const ApiTransactionTerms = () => {
    const terms = [
        {
            message:
                '旅遊金兌換活動為勞務報籌，兌換者須於規定時間內產出行程體驗文章作為交換，因此本活動非機會中獎活動，兌換者不需支付機會中獎相關稅賦；倘若兌換者未完成相關活動條件，則仍須負擔機會中獎相關稅賦',
        },
        {
            message:
                '旅遊金兌換活動為勞務報籌，兌換者須於規定時間內產出行程體驗文章作為交換，因此本活動非機會中獎活動，兌換者不需支付機會中獎相關稅賦；倘若兌換者未完成相關活動條件，則仍須負擔機會中獎相關稅賦',
        },
        {
            message:
                '旅遊金兌換活動為勞務報籌，兌換者須於規定時間內產出行程體驗文章作為交換，因此本活動非機會中獎活動，兌換者不需支付機會中獎相關稅賦；倘若兌換者未完成相關活動條件，則仍須負擔機會中獎相關稅賦',
        },
        {
            message:
                '旅遊金兌換活動為勞務報籌，兌換者須於規定時間內產出行程體驗文章作為交換，因此本活動非機會中獎活動，兌換者不需支付機會中獎相關稅賦；倘若兌換者未完成相關活動條件，則仍須負擔機會中獎相關稅賦',
        },
        {
            message:
                '旅遊金兌換活動為勞務報籌，兌換者須於規定時間內產出行程體驗文章作為交換，因此本活動非機會中獎活動，兌換者不需支付機會中獎相關稅賦；倘若兌換者未完成相關活動條件，則仍須負擔機會中獎相關稅賦',
        },
        {
            message:
                '旅遊金兌換活動為勞務報籌，兌換者須於規定時間內產出行程體驗文章作為交換，因此本活動非機會中獎活動，兌換者不需支付機會中獎相關稅賦；倘若兌換者未完成相關活動條件，則仍須負擔機會中獎相關稅賦',
        },
    ];

    const remark = {
        mail: {
            link: '#',
            name: '欣傳媒旅遊金客服信箱',
        },
        message:
            '欣傳媒有權決定取消、終止、修改或暫停本活動並保有最終解釋義權。如有任何疑問，可E-mail來信與本單位聯繫：',
    };

    const output = {
        terms: terms,
        remark: remark,
    };

    return output;
};

module.exports = ApiTransactionTerms;
